{
    "objects": [
        {
            "name": "Plan",
            "description": "Identify and align an operation with a desired end-state.\n\nPlanning is used to identify and align an operation within the context of strategic goals. By helping the defender to first identify their goals, Planning ensures that all engagement activities are focused and driving forward progress. Additionally, planning ensures that the defender can integrate the inputs of the various stakeholders at the beginning of an operation to ensure that the operation is efficient, effective, and safe. Finally, Planning activities ensure that each operation is informed by the successes and learns from the failures of past operations.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/SAP0001",
                    "external_id": "SAP0001"
                }
            ],
            "x_mitre_shortname": "plan",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--8f524eff-6ccd-44f9-9977-fa2896bf0fb2",
            "created": "2022-03-30T14:46:42.554Z",
            "modified": "2022-03-30T14:46:42.554Z"
        },
        {
            "name": "Collect",
            "description": "Gather adversary tools, observe tactics, and collect other raw intelligence about the adversary's activity.\n\nCollection is used to gather information about an adversary or their activities. This collection can include gathering system logs, network traffic, adversary artifacts, or other data that can be used to expose adversary activity. In many cases, Collection activities are also good cybersecurity practices. However, in Engage, these activities will focus exclusively on the intersection of denial, deception, and adversary engagement technologies and the defender\\u2019s ability to Expose the adversary.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/EAP0001",
                    "external_id": "EAP0001"
                }
            ],
            "x_mitre_shortname": "collect",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--d029d9e3-6850-4b46-87fe-99f35b104e86",
            "created": "2022-03-30T14:46:42.554Z",
            "modified": "2022-03-30T14:46:42.554Z"
        },
        {
            "name": "Detect",
            "description": "Establish or maintain awareness in regard to adversary activity.\n\nDetection focuses on the defender's ability to monitor adversary activity throughout an environment, often by creating high-fidelity detections. These detections can be produced in several ways. For example, a defender can deploy decoy artifacts as tripwires in the environment. The defender may create custom alerts based on TTPs or IOCs observed during a malware detonation operation. Finally, the defender may write customer decoders to analyze and alert on malicious traffic.\nIn all these cases, detection activities allow the defender to produce a high-fidelity alert to monitor adversary activities. Often Detection activities are also good cybersecurity practices. However, in Engage, these activities will focus exclusively on the intersection of denial, deception, and adversary engagement technologies and the defender's ability to Expose the adversary.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/EAP0002",
                    "external_id": "EAP0002"
                }
            ],
            "x_mitre_shortname": "detect",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--d44c5cea-8fce-417b-b5f7-a52c62de6f91",
            "created": "2022-03-30T14:46:42.554Z",
            "modified": "2022-03-30T14:46:42.554Z"
        },
        {
            "name": "Prevent",
            "description": "Stop all or part of the adversary's ability to conduct their operation as intended.\n\nPrevention focuses on stopping the adversary's ability to conduct their operations as intended. The defender can physically or virtually remove or disable resources, tighten security controls, or otherwise impair the adversary's ability to operate. A defender might prevent an adversary from operating to force them to reveal different, possibly more advanced, capabilities. Additionally, a defender can use Prevention to discourage the adversary from operating against a specific target. In this case, the defender may be attempting to encourage the adversary to focus elsewhere in the engagement environment.\nThere are many more Prevention activities that are also good cybersecurity practices. However, in Engage, we are focused on a subset of activities. Those are focused exclusively on the intersection of denial, deception, and adversary engagement technologies and the defender\\u2019s ability to Affect the adversary.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/EAP0003",
                    "external_id": "EAP0003"
                }
            ],
            "x_mitre_shortname": "prevent",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--16558f1f-e51a-4066-b34a-2557b9f7bdc7",
            "created": "2022-03-30T14:46:42.554Z",
            "modified": "2022-03-30T14:46:42.554Z"
        },
        {
            "name": "Direct",
            "description": "Encourage or discourage the adversary from conducting their operation as intended.\n\nDirection focuses on moving the adversary towards or away from an intended path. This forced direction can be accomplished by removing or disabling some resources, while adding or enabling others. The defender can add decoy articles or otherwise manipulate the environment to attempt to elicit specific responses from the adversary. Additionally, the defender can tighten some security controls while leaving others overly permissive or weakened. Finally, the defender can physically move the adversary by moving threats from their intended environment and into a safe engagement environment.\nFor example, a suspicious email attachment can be moved from the intended target to an engagement environment for analysis. No matter how the Direction is achieved, the defender hopes to force the adversary to take unintended actions, or stop intended actions.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/EAP0004",
                    "external_id": "EAP0004"
                }
            ],
            "x_mitre_shortname": "direct",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--03eda9cb-2c93-4ce9-abb5-7fbd5b9ba3c3",
            "created": "2022-03-30T14:46:42.554Z",
            "modified": "2022-03-30T14:46:42.554Z"
        },
        {
            "name": "Disrupt",
            "description": "Impair an adversary's ability to conduct their operation as intended.\n\nDisruption is used to stop or discourage an adversary from conducting part or all of their mission. This disruption may increase the time, skills, or resources needed for the adversary to accomplish a specific task. For example, a defender may degrade network speeds as the adversary attempts to exfiltrate large blocks of data. As a second example, the defender may manipulate the output of commonly used discovery commands to show targets that do not exist or to hide real targets. In either case, the adversary may waste resources acting on partial or falsified data.\nDisruptions may also include planting misinformation designed to influence the adversary's decision-makers to make the wrong decisions or to waste resources.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/EAP0005",
                    "external_id": "EAP0005"
                }
            ],
            "x_mitre_shortname": "disrupt",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--b12ec5cf-546c-4116-876b-923b43f232d8",
            "created": "2022-03-30T14:46:42.554Z",
            "modified": "2022-03-30T14:46:42.554Z"
        },
        {
            "name": "Reassure",
            "description": "Add authenticity to deceptive components to convince an adversary that an environment is real.\n\nReassurance is used to add authenticity to deceptive components to reduce adversary suspicion about the legitimacy of the environment. Activities include adding realistic user accounts, files, system activity, and any other content that an adversary might expect to find on the system. Reassurance may add new artifacts, such as peripherals and pocket litter, while concealing others, such as how recently an environment was stood up. If done correctly, Reassurance may help to make an adversary feel more comfortable upon landing in a new environment. This initial level of comfort can help anchor the adversary in the environment, increasing their tolerance to faults or weaknesses discovered later.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/EAP0006",
                    "external_id": "EAP0006"
                }
            ],
            "x_mitre_shortname": "reassure",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--9863f13f-038c-4cf3-90ed-032eda35a9e7",
            "created": "2022-03-30T14:46:42.555Z",
            "modified": "2022-03-30T14:46:42.555Z"
        },
        {
            "name": "Motivate",
            "description": "Encourage an adversary to conduct part or all of their mission.\n\nMotivation is used to encourage an adversary to conduct part or all of their mission by providing a target-rich environment. To do this, the defender can use unpatched versions of operating systems and software, remove end-point detection software, and use weak passwords. Additionally, the defender can open firewall ports, add proxy capabilities, or introduce elements that an adversary can easily leverage to bypass an obstacle in their operations. Finally, the defender can include enticing data to the environment to encourage the adversary to steal the data.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/EAP0007",
                    "external_id": "EAP0007"
                }
            ],
            "x_mitre_shortname": "motivate",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--472b7bdd-c8b5-4011-b031-ed142e2f40e1",
            "created": "2022-03-30T14:46:42.555Z",
            "modified": "2022-03-30T14:46:42.555Z"
        },
        {
            "name": "Analyze",
            "description": "Retrospective review of information gained from an operation.\n\nAnalysis is used to aggregate, examine, and evaluate the results of an operation. Analysis is useful for improving the defender's security posture through the synthesis of operational data. Additionally, analysis can be used to turn data into actionable intelligence about an adversary's motivators, behaviors, tactics, and techniques.\nDefenders can use analysis to gain insight into adversary activity and thus inform detection and analytics refinements. Reviewing the execution of an operation also provides feedback for the team to improve the quality of future operations. Finally, Analysis activities ensure that each operation is informed by the successes and learns from the failures of past operations.\n",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/approaches/SAP0002",
                    "external_id": "SAP0002"
                }
            ],
            "x_mitre_shortname": "analyze",
            "type": "x-mitre-approach",
            "id": "x-mitre-approach--cfca0285-50fd-4a46-9ac0-c9419f00d8fc",
            "created": "2022-03-30T14:46:42.555Z",
            "modified": "2022-03-30T14:46:42.555Z"
        },
        {
            "name": "Baseline",
            "description": "Identify key system elements to establish a baseline and be prepared to reset a system to that baseline when necessary.\n\nTo determine the system Baseline, the defender must identify software and configuration elements that are critical to a set of objectives. The defender must define the proper values and be prepared to reset a running system to its intended state. Reverting to a Baseline configuration can be essential when restoring an operational environment to a safe state or when looking to impose a cost on adversaries by preventing their activity.\nFor example, the defender can watch for an adversary to make changes in the environment and then revert the environment with the goal of either forcing the adversary to target elsewhere in the network or to display a new, possibly more advanced TTP. The baseline values will also be crucial post-operation when analyzing changes to the environment over time.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "prevent"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0019",
                    "external_id": "EAC0019"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--64064c47-a0a8-45ed-b667-521dc5406323",
            "created": "2022-03-30T14:46:42.551Z",
            "modified": "2022-03-30T14:46:42.551Z"
        },
        {
            "name": "Hardware Manipulation",
            "description": "Alter the hardware configuration of a system to limit what an adversary can do with the device.\n\nHardware Manipulation can include physical or configuration changes to the hardware in the environment. This manipulation can include physically removing a system's microphone, camera, on-board Wi-Fi adapter, etc. or using software controls to disable those devices. These types of manipulations can affect the adversary's ability to achieve their operational objectives by incurring an increased resource cost, forcing them to change tactics, or stopping them altogether.\nHardware Manipulation is often required to maintain operational safety. For example, if the operation includes Detonating Malware using a laptop physically located in a shared space, it is likely that the defender will not have the ability to hide the legitimate conversations and individuals present in the space. Unless the defender has the ability to control the background sounds and visuals, it is likely too risky to leave the camera and microphone connected to the machine.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "prevent"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0017",
                    "external_id": "EAC0017"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--b16e6519-fab5-4c80-98df-0e60d076093f",
            "created": "2022-03-30T14:46:42.551Z",
            "modified": "2022-03-30T14:46:42.551Z"
        },
        {
            "name": "Isolation",
            "description": "Using Isolation, a defender can limit the effectiveness and scope of malicious activity and/or lower exposure to unintended risks. When a system or resource is isolated, a defender can observe adversary behaviors or tools without allowing lateral movement. For example, a defender may detonate a piece of malware on an isolated system to perform dynamic analysis without risk to other network resources.\nDetermining which systems should be isolated in an operation is a critical decision when calculating acceptable operational risk. However, if the adversary expects to find an entire corporate network but instead finds only an isolated system, they may not be interested in engaging with the target. Balancing acceptable risk, believability, and operational goals is essential when determining if or when a system should be isolated.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "prevent"
                },
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "disrupt"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0020",
                    "external_id": "EAC0020"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--0e114908-c66d-405d-9681-75680589596c",
            "created": "2022-03-30T14:46:42.552Z",
            "modified": "2022-03-30T14:46:42.552Z"
        },
        {
            "name": "Netowrk Manipulation",
            "description": "Make changes to network properties and functions to achieve a desired effect.\n\nNetwork Manipulation allows a defender to throttle network speeds, segment the network, maintain a unique IP addressing scheme, add a kill switch to cut off network access, etc. These types of manipulations can affect the adversary's ability to achieve their operational objectives by incurring an increased resource cost, forcing them to change tactics, or stopping them altogether.\nFor example, a defender can limit the allowed ports or network requests to force the adversary to alter their planned C2 or exfiltration channels. As another example, a defender could allow or deny outbound SMB requests from a network to affect the success of forced authentication. Additionally, the defender can degrade network speeds and reliability to impose a resource cost as adversaries exfiltrate large quantities of data. Finally, a defender can block primary C2 domains and IPs to determine if the adversary has additional infrastructure. While there are a range of network manipulation options, in all cases, the defender has an opportunity to learn about or influence the adversaries operating in the environment.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "prevent"
                },
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                },
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "disrupt"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0016",
                    "external_id": "EAC0016"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--a6259f55-e6b9-47a6-811e-dc3be0df1611",
            "created": "2022-03-30T14:46:42.552Z",
            "modified": "2022-03-30T14:46:42.552Z"
        },
        {
            "name": "Security Controls",
            "description": "Alter security controls to make the system more or less vulnerable to attack.\n\nManipulating Security Controls involves making configuration changes to a system's security settings including modifying Group Policies, disabling/enabling autorun for removable media, tightening or relaxing system firewalls, etc. Such security controls can be tightened to dissuade or prevent adversary activity. Conversely, security controls can be weakened or left overly permissive to encourage or enable adversary activity.\nTightening security controls can typically be done by implementing any of the mitigations described in MITRE ATT&CK. See https://attack.mitre.org/mitigations/enterprise/ for a full list of mitigation strategies. While loosening security controls may seem obvious (i.e., simply don't employ a given mitigation strategy), there is an additional level of nuance that must be considered. Some security controls are considered so routine that its absence may be suspicious.\nFor example, completely turning off Windows Defender would likely raise the adversary's suspicion. However, it is possible to turn off Windows Defender in certain shared drives to encourage adversary activity in predetermined locations. Therefore, it will likely be far less suspicious to turn off Windows Defender in a single directory or share. When assessing the likelihood that removing a given security control is overly suspicious, it is important to consider how prevalent that security control is, the target adversary's sophistication, and the deception story.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "prevent"
                },
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0018",
                    "external_id": "EAC0018"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--84e3cae9-d9d2-446f-b686-026e623c5f9c",
            "created": "2022-03-30T14:46:42.552Z",
            "modified": "2022-03-30T14:46:42.552Z"
        },
        {
            "name": "Attack Vector Migration",
            "description": "Move a malicious link, file, or device from its intended location to a decoy system or network for execution/use.\n\nWhen a defender Migrates an Attack Vector, the defender intercepts a malicious element and moves it to a safe environment, such as a decoy system within a decoy network, for continued engagement or analysis. A defender may choose to migrate attack vectors, which may appear in the form of phishing emails, suspicious email attachments, or malicious USBs. For example, a defender might move a suspicious attachment from a corporate inbox to an inbox on a system that, while in the corporate IP space, is completely segmented from the enterprise network. This segregated environment will allow the adversary to move laterally throughout the environment without risk to enterprise resources.\nDetermining when an engagement should be moved to an engagement environment is a critical decision when calculating acceptable operational risk. However, if the adversary sent a custom malware sample to a phishing victim, but ultimately find themselves on an unrelated victim, they may be suspicious. Balancing this acceptable risk, believability, and operational goals is essential when determining if or when to migrate an attack vector.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0021",
                    "external_id": "EAC0021"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--276c99c7-ae42-42f4-ae47-523db3957f2d",
            "created": "2022-03-30T14:46:42.552Z",
            "modified": "2022-03-30T14:46:42.552Z"
        },
        {
            "name": "Email Manipulation",
            "description": "Modify the flow of email in the environment.\n\nEmail Manipulation covers the various ways email flows in the environment can be affected. Email Manipulation can affect which mail appliances process mail flows, where mail is forwarded, or what mail is present in an inbox. A common use case for email manipulation is as a vector to introduce malware into the engagement environment.\nSuspicious emails may be removed from production mailbox and placed into an inbox in an engagement environment. Then, any suspicious attachments or links could be detonated from within the environment. As another example, emails collected over a long period of time from a legitimate inbox outside the environment may be moved into the environment to reassure the adversary of the environment's legitimacy by creating a mailbox that more closely resembles a real, lived-in inbox.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0009",
                    "external_id": "EAC0009"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--641ff01b-f5a4-4949-aa95-2cfbbf6b9f09",
            "created": "2022-03-30T14:46:42.552Z",
            "modified": "2022-03-30T14:46:42.552Z"
        },
        {
            "name": "Introduced Vulnerabilities",
            "description": "Intentionally introduce vulnerabilities into the environment for the adversary to exploit.\n\nBy intentionally Introducing Vulnerabilities into the engagement environment, the defender can attempt to motivate the adversary to target specific resources. This targeting may serve to move the adversary towards a particular resource, or away from another resource. At other times, the defender may Introduce Vulnerabilities as amean of encouraging the adversary to reveal targeting preferences, available capabilities, or even to influence future targeting decisions. The operational objectives will drive how and why the defender Introduces Vulnerabilities in the engagement environment.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0023",
                    "external_id": "EAC0023"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--0b144139-9baf-4367-b9ff-91321e6d8f3b",
            "created": "2022-03-30T14:46:42.553Z",
            "modified": "2022-03-30T14:46:42.553Z"
        },
        {
            "name": "Lures",
            "description": "Deceptive systems and artifacts intended to serve as decoys, breadcrumbs, or bait to elicit a specific response from the adversary.\n\nLures are intended to elicit a particular response from the adversary. For example, the defender may utilize Lures to enable or block adversary's intended action or encourage or discourage a specific action or response. Lures can take a veriety of forms including credentials, accounts, files/directories, browser extensions/bookmarks, system processes, etc. Regardless of form, Lures provide opportunities to the defender to drive adversary behavior in ways that align with operational outcomes.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                },
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "disrupt"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0005",
                    "external_id": "EAC0005"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--4a9b7d97-3af9-4983-84ae-c7792138af76",
            "created": "2022-03-30T14:46:42.553Z",
            "modified": "2022-03-30T14:46:42.553Z"
        },
        {
            "name": "Malware Detonation",
            "description": "Execute malware under controlled conditions to analyze its functionality.\n\nMalware can be detonated in a controlled and safe environment. Clear goals and safety procedures should always be established before detonation to ensure that the operation is focused and safe. The malware can be detonated in an execution environment ranging from a somewhat sterile commercial malware execution appliance to a bespoke engagement environment crafted to support an extended engagement.\nOutcomes of a malware detonation operation can include new IOCs collected during dynamic analysis, additional TTPs elicited by detonating the malware in a target rich environment, and/or negative impacts to the adversary and their operation. These outcomes can be used to produce new analytics for high-fidelity analytics.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0013",
                    "external_id": "EAC0013"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--26913c3b-db49-4fe3-b2e1-3131bf8a1d65",
            "created": "2022-03-30T14:46:42.553Z",
            "modified": "2022-03-30T14:46:42.553Z"
        },
        {
            "name": "Peripheral Management",
            "description": "Manage peripheral devices used on systems within the network for engagement purposes.\n\nPeripheral Management is the administration of peripheral devices used on systems within the engagement environment. A defender can choose to allow or deny certain types of peripherals from being used on systems to either motivate or demotivate adversary activity or to direct the adversary towards specific targets. Defenders can also introduce peripherals to an adversary-controlled system to see how the adversary reacts. For example, the defender can introduce external Wi-Fi adapters, USB devices, etc. to determine if adversaries attempt to use them for exfiltration purposes.\nAdditionally, peripherals provide an avenue for the defender to present new or additional information to the adversary. This information can be used to introduce an additional attack surface, motivate or demotivate adversary activity, or to further the deception story. For example, the defender may include data on a connected USB device or stage an important conversation near an externally connected camera or microphone. Depending on the contents of this data, the adversary may be encouraged to take a specific action and/or reassured about the legitimacy of the environment.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0010",
                    "external_id": "EAC0010"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--7fae652f-2f30-452f-b1d9-776c35e57186",
            "created": "2022-03-30T14:46:42.553Z",
            "modified": "2022-03-30T14:46:42.553Z"
        },
        {
            "name": "Software Manipulation",
            "description": "Make changes to a system's software properties and functions to achieve a desired effect.\n\nSoftware Manipulation allows a defender to alter or replace elements of the OS, file system, or any other software installed and executed on a system. These alterations can affect outputs, degrade effectiveness, and/or prevent the software from functioning altogether. For example, the defender can manipulate software by changing the output of commonly used discovery commands to hide legitimate systems and artifacts and/or reveal decoy artifacts and systems.\nAlternatively, the defender can change the output of the password policy description for an adversary attempting to brute-force credentials. This manipulation may cause the adversary to waste resources brute-forcing passwords with inaccurate complexity requirements. If the defender wanted to degrade software effectiveness, they might weaken algorithms to expose data that is being archived, encoded, and/or encrypted.\nFinally, to prevent software from functioning altogether, the defender may cause software typically used to delete data or hide adversary artifacts to fail. For some Software Manipulation use cases, it may be possible to make changes in such a way that adversary actions and legitimate user actions are handled differently. For example, the defender could show all files when viewed in a graphical application but hide files or introduce decoy files when viewed via a terminal command. This would allow legitimate users full access to the file system while adversaries using a reverse shell to access the target would see the manipulated the files.\n",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "direct"
                },
                {
                    "kill_chain_name": "mitre-engage",
                    "phase_name": "disrupt"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200/activities/EAC0014",
                    "external_id": "EAC0014"
                }
            ],
            "x_mitre_platforms": [
                "ENGAGE"
            ],
            "type": "attack-pattern",
            "id": "attack-pattern--3755676b-f314-42b1-9407-aa2e5954f76c",
            "created": "2022-03-30T14:46:42.553Z",
            "modified": "2022-03-30T14:46:42.553Z"
        },
        {
            "name": "ENGAGE 1.0.0",
            "description": "Engage Navigator: engage.mitre.org",
            "external_references": [
                {
                    "source_name": "mitre-engage",
                    "url": "https://localhost:4200",
                    "external_id": "mitre-engage"
                }
            ],
            "tactic_refs": [
                "x-mitre-approach--8f524eff-6ccd-44f9-9977-fa2896bf0fb2",
                "x-mitre-approach--d029d9e3-6850-4b46-87fe-99f35b104e86",
                "x-mitre-approach--d44c5cea-8fce-417b-b5f7-a52c62de6f91",
                "x-mitre-approach--16558f1f-e51a-4066-b34a-2557b9f7bdc7",
                "x-mitre-approach--03eda9cb-2c93-4ce9-abb5-7fbd5b9ba3c3",
                "x-mitre-approach--b12ec5cf-546c-4116-876b-923b43f232d8",
                "x-mitre-approach--9863f13f-038c-4cf3-90ed-032eda35a9e7",
                "x-mitre-approach--472b7bdd-c8b5-4011-b031-ed142e2f40e1",
                "x-mitre-approach--cfca0285-50fd-4a46-9ac0-c9419f00d8fc"
            ],
            "type": "x-mitre-matrix",
            "id": "x-mitre-matrix--b4796829-90d3-47c0-a75d-4adcbd1e2166",
            "created": "2022-03-30T14:46:42.555Z",
            "modified": "2022-03-30T14:46:42.555Z"
        }
    ],
    "type": "bundle",
    "id": "bundle--0819702f-cdd0-4291-b8f7-869033301a71",
    "spec_version": "2.0"
}