{"objects": [{"name": "Plan", "description": "Identify and align an operation with a desired end-state.\n\nPlanning is used to identify and align an operation within the context of strategic goals. By helping the defender to first identify their goals, Planning ensures that all engagement activities are focused and driving forward progress. Additionally, planning ensures that the defender can integrate the inputs of the various stakeholders at the beginning of an operation to ensure that the operation is efficient, effective, and safe. Finally, Planning activities ensure that each operation is informed by the successes and learns from the failures of past operations.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/SAP0001", "external_id": "SAP0001"}], "x_mitre_shortname": "plan", "type": "x-mitre-tactic", "id": "x-mitre-tactic--bfe8f34c-e181-47ce-bbd1-1ede949480b9", "created": "2022-03-30T13:30:41.440Z", "modified": "2022-03-30T13:30:41.440Z"}, {"name": "Collect", "description": "Gather adversary tools, observe tactics, and collect other raw intelligence about the adversary's activity.\n\nCollection is used to gather information about an adversary or their activities. This collection can include gathering system logs, network traffic, adversary artifacts, or other data that can be used to expose adversary activity. In many cases, Collection activities are also good cybersecurity practices. However, in Engage, these activities will focus exclusively on the intersection of denial, deception, and adversary engagement technologies and the defender\\u2019s ability to Expose the adversary.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/EAP0001", "external_id": "EAP0001"}], "x_mitre_shortname": "collect", "type": "x-mitre-tactic", "id": "x-mitre-tactic--ce3c52c4-19c9-4139-821d-54ae027b25d5", "created": "2022-03-30T13:30:41.441Z", "modified": "2022-03-30T13:30:41.441Z"}, {"name": "Detect", "description": "Establish or maintain awareness in regard to adversary activity.\n\nDetection focuses on the defender's ability to monitor adversary activity throughout an environment, often by creating high-fidelity detections. These detections can be produced in several ways. For example, a defender can deploy decoy artifacts as tripwires in the environment. The defender may create custom alerts based on TTPs or IOCs observed during a malware detonation operation. Finally, the defender may write customer decoders to analyze and alert on malicious traffic.\nIn all these cases, detection activities allow the defender to produce a high-fidelity alert to monitor adversary activities. Often Detection activities are also good cybersecurity practices. However, in Engage, these activities will focus exclusively on the intersection of denial, deception, and adversary engagement technologies and the defender's ability to Expose the adversary.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/EAP0002", "external_id": "EAP0002"}], "x_mitre_shortname": "detect", "type": "x-mitre-tactic", "id": "x-mitre-tactic--9c8e405c-8257-40c8-9737-7a286ece7589", "created": "2022-03-30T13:30:41.441Z", "modified": "2022-03-30T13:30:41.441Z"}, {"name": "Prevent", "description": "Stop all or part of the adversary's ability to conduct their operation as intended.\n\nPrevention focuses on stopping the adversary's ability to conduct their operations as intended. The defender can physically or virtually remove or disable resources, tighten security controls, or otherwise impair the adversary's ability to operate. A defender might prevent an adversary from operating to force them to reveal different, possibly more advanced, capabilities. Additionally, a defender can use Prevention to discourage the adversary from operating against a specific target. In this case, the defender may be attempting to encourage the adversary to focus elsewhere in the engagement environment.\nThere are many more Prevention activities that are also good cybersecurity practices. However, in Engage, we are focused on a subset of activities. Those are focused exclusively on the intersection of denial, deception, and adversary engagement technologies and the defender\\u2019s ability to Affect the adversary.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/EAP0003", "external_id": "EAP0003"}], "x_mitre_shortname": "prevent", "type": "x-mitre-tactic", "id": "x-mitre-tactic--66af00c1-7620-4408-ace3-db01e3b503d0", "created": "2022-03-30T13:30:41.441Z", "modified": "2022-03-30T13:30:41.441Z"}, {"name": "Direct", "description": "Encourage or discourage the adversary from conducting their operation as intended.\n\nDirection focuses on moving the adversary towards or away from an intended path. This forced direction can be accomplished by removing or disabling some resources, while adding or enabling others. The defender can add decoy articles or otherwise manipulate the environment to attempt to elicit specific responses from the adversary. Additionally, the defender can tighten some security controls while leaving others overly permissive or weakened. Finally, the defender can physically move the adversary by moving threats from their intended environment and into a safe engagement environment.\nFor example, a suspicious email attachment can be moved from the intended target to an engagement environment for analysis. No matter how the Direction is achieved, the defender hopes to force the adversary to take unintended actions, or stop intended actions.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/EAP0004", "external_id": "EAP0004"}], "x_mitre_shortname": "direct", "type": "x-mitre-tactic", "id": "x-mitre-tactic--59b496d2-514e-4b76-a5bd-42edc04a8ebe", "created": "2022-03-30T13:30:41.441Z", "modified": "2022-03-30T13:30:41.441Z"}, {"name": "Disrupt", "description": "Impair an adversary's ability to conduct their operation as intended.\n\nDisruption is used to stop or discourage an adversary from conducting part or all of their mission. This disruption may increase the time, skills, or resources needed for the adversary to accomplish a specific task. For example, a defender may degrade network speeds as the adversary attempts to exfiltrate large blocks of data. As a second example, the defender may manipulate the output of commonly used discovery commands to show targets that do not exist or to hide real targets. In either case, the adversary may waste resources acting on partial or falsified data.\nDisruptions may also include planting misinformation designed to influence the adversary's decision-makers to make the wrong decisions or to waste resources.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/EAP0005", "external_id": "EAP0005"}], "x_mitre_shortname": "disrupt", "type": "x-mitre-tactic", "id": "x-mitre-tactic--bcbb34ef-29ba-477b-8ca6-a0704fe4df68", "created": "2022-03-30T13:30:41.441Z", "modified": "2022-03-30T13:30:41.441Z"}, {"name": "Reassure", "description": "Add authenticity to deceptive components to convince an adversary that an environment is real.\n\nReassurance is used to add authenticity to deceptive components to reduce adversary suspicion about the legitimacy of the environment. Activities include adding realistic user accounts, files, system activity, and any other content that an adversary might expect to find on the system. Reassurance may add new artifacts, such as peripherals and pocket litter, while concealing others, such as how recently an environment was stood up. If done correctly, Reassurance may help to make an adversary feel more comfortable upon landing in a new environment. This initial level of comfort can help anchor the adversary in the environment, increasing their tolerance to faults or weaknesses discovered later.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/EAP0006", "external_id": "EAP0006"}], "x_mitre_shortname": "reassure", "type": "x-mitre-tactic", "id": "x-mitre-tactic--b7409551-5617-49f1-aa52-cc5ab02909e6", "created": "2022-03-30T13:30:41.441Z", "modified": "2022-03-30T13:30:41.441Z"}, {"name": "Motivate", "description": "Encourage an adversary to conduct part or all of their mission.\n\nMotivation is used to encourage an adversary to conduct part or all of their mission by providing a target-rich environment. To do this, the defender can use unpatched versions of operating systems and software, remove end-point detection software, and use weak passwords. Additionally, the defender can open firewall ports, add proxy capabilities, or introduce elements that an adversary can easily leverage to bypass an obstacle in their operations. Finally, the defender can include enticing data to the environment to encourage the adversary to steal the data.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/EAP0007", "external_id": "EAP0007"}], "x_mitre_shortname": "motivate", "type": "x-mitre-tactic", "id": "x-mitre-tactic--d8722a7d-3a28-4f2b-bb85-5cc50fd1aafa", "created": "2022-03-30T13:30:41.441Z", "modified": "2022-03-30T13:30:41.441Z"}, {"name": "Analyze", "description": "Retrospective review of information gained from an operation.\n\nAnalysis is used to aggregate, examine, and evaluate the results of an operation. Analysis is useful for improving the defender's security posture through the synthesis of operational data. Additionally, analysis can be used to turn data into actionable intelligence about an adversary's motivators, behaviors, tactics, and techniques.\nDefenders can use analysis to gain insight into adversary activity and thus inform detection and analytics refinements. Reviewing the execution of an operation also provides feedback for the team to improve the quality of future operations. Finally, Analysis activities ensure that each operation is informed by the successes and learns from the failures of past operations.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200/approaches/SAP0002", "external_id": "SAP0002"}], "x_mitre_shortname": "analyze", "type": "x-mitre-tactic", "id": "x-mitre-tactic--781cfcfa-993b-42c0-9d64-71da2708d25a", "created": "2022-03-30T13:30:41.442Z", "modified": "2022-03-30T13:30:41.442Z"}, {"name": "ENGAGE 1.0.0", "description": "Engage Navigator: atlas.mitre.org", "external_references": [{"source_name": "mitre-atlas", "url": "https://localhost:4200", "external_id": "mitre-atlas"}], "tactic_refs": ["x-mitre-tactic--bfe8f34c-e181-47ce-bbd1-1ede949480b9", "x-mitre-tactic--ce3c52c4-19c9-4139-821d-54ae027b25d5", "x-mitre-tactic--9c8e405c-8257-40c8-9737-7a286ece7589", "x-mitre-tactic--66af00c1-7620-4408-ace3-db01e3b503d0", "x-mitre-tactic--59b496d2-514e-4b76-a5bd-42edc04a8ebe", "x-mitre-tactic--bcbb34ef-29ba-477b-8ca6-a0704fe4df68", "x-mitre-tactic--b7409551-5617-49f1-aa52-cc5ab02909e6", "x-mitre-tactic--d8722a7d-3a28-4f2b-bb85-5cc50fd1aafa", "x-mitre-tactic--781cfcfa-993b-42c0-9d64-71da2708d25a"], "type": "x-mitre-matrix", "id": "x-mitre-matrix--b9f072d9-a37d-4ca2-b659-de2733877cd8", "created": "2022-03-30T13:30:41.442Z", "modified": "2022-03-30T13:30:41.442Z"}], "type": "bundle", "id": "bundle--bd49d6fe-40f6-4e2a-9b13-bdb3a766f3e5", "spec_version": "2.0"}